## **IMPORTAR LIBRERIAS Y DATAFRAMES**

In [1]:
import pandas as pd
import seaborn as sns
##Estas librerias son para el uso de SQL dentro de Python
from sqlalchemy import engine
from pandasql import sqldf

##Función lambda que hace escribir funciones sql más fácil
pysqldf = lambda q: sqldf(q, globals())

In [2]:
#Importar el primer dataframe con los datos de los libros
df = pd.read_csv('Books_data.csv')

In [38]:
#Importar el segundo dataframe con la información de los ratings de los libros
df2 = pd.read_csv('Books_rating.csv')

## **LIMPIEZA Y TRANSFORMACIÓN DE DATOS**

In [3]:
#Código para ver el tipo de datos en el primer dataframe
display(
	df,
    df.dtypes
)

,Unnamed: 0,title,authors,publisher,categories,ratingsCount
0,0,Its Only Art If Its Well Hung!,['Julie Strain'],NaN,['Comics & Graphic Novels'],0.0
1,1,Dr. Seuss: American Icon,['Philip Nel'],A&C Black,['Biography & Autobiography'],0.0
2,2,Wonderful Worship in Smaller Churches,['David R. Ray'],NaN,['Religion'],0.0
3,3,Whispers of the Wicked Saints,['Veronica Haddon'],iUniverse,['Fiction'],0.0
4,4,"Nation Dance: Religion, Identity and Cultural ...",['Edward Long'],NaN,NaN,0.0
...,...,...,...,...,...,...
180985,212398,Autodesk Inventor 10 Essentials Plus,"['Daniel Banach', 'Travis Jones']",SDC Publications,['Computers'],0.0
180986,212399,The Orphan Of Ellis Island (Time Travel Advent...,['Elvira Woodruff'],Scholastic Paperbacks,['Juvenile Fiction'],2.0
180987,212401,Mamaw,['Wild Wild Cabbage'],NaN,NaN,0.0
180988,212402,The Autograph Man,['Zadie Smith'],Vintage,['Fiction'],19.0
180989,212403,Student's Solutions Manual for Johnson/Mowry's...,"['David B. Johnson', 'Thomas A. Mowry']",Brooks/Cole Publishing Company,NaN,0.0

Unnamed: 0        int64
title            object
authors          object
publisher        object
categories       object
ratingsCount    float64
dtype: object

In [128]:
#Para trabajar con el primer dataframe dejo solo las columnas con las voy a trabajar
df = df[['Title', 'authors', 'publisher', 'categories', 'ratingsCount']]

In [7]:
#Comprobamos si hay filas duplicadas
df.duplicated().sum()

0

In [68]:
#Compruebo si hay valores nulos en la columna Title
df['Title'].isnull().sum()

0

In [130]:
#Elimino los valores nulos de la columna Title
df = df.dropna(subset=['Title'])

In [99]:
#Compruebo si hay valores nulos en la columna authors
df['authors'].isnull().sum()

0

In [131]:
#Elimino los valores nulos de la columna authors
df = df.dropna(subset=['authors'])

In [ ]:
#Compruebo si existe un valor en especifico en la columna authors
df.groupby(['authors']).get_group("['Maharshi Ramana']")

In [70]:
#Compruebo el numero de valores nulos en la columna publisher
df['publisher'].isnull().sum()

46119

In [15]:
#df = df.dropna(subset=('publisher'))

In [71]:
df['publishedDate'].isnull().sum()

974

In [17]:
#df=df.dropna(subset=('publishedDate'))

In [101]:
df['ratingsCount'].isnull().sum()

0

In [133]:
#Combertir los nulos de la columna ratingsCount en ceros
df['ratingsCount'].fillna(0, inplace=True)

In [ ]:
df.groupby(['ratingsCount']).get_group(0)

In [149]:
#Quitar los corchetes y las comillas de las columnas authors y categories del dataframe1
x = ['authors', 'categories'] 
df[x] = df[x].replace({"\['": ""}, regex=True)
df[x] = df[x].replace({'\["': ''}, regex=True)
df[x] = df[x].replace({"\']": ""}, regex=True)
df[x] = df[x].replace({'\"]': ''}, regex=True)

In [150]:
df

,Title,authors,publisher,categories,ratingsCount
0,Its Only Art If Its Well Hung!,Julie Strain,NaN,Comics & Graphic Novels,0.0
1,Dr. Seuss: American Icon,Philip Nel,A&C Black,Biography & Autobiography,0.0
2,Wonderful Worship in Smaller Churches,David R. Ray,NaN,Religion,0.0
3,Whispers of the Wicked Saints,Veronica Haddon,iUniverse,Fiction,0.0
4,"Nation Dance: Religion, Identity and Cultural ...",Edward Long,NaN,NaN,0.0
...,...,...,...,...,...
212398,Autodesk Inventor 10 Essentials Plus,"Daniel Banach', 'Travis Jones",SDC Publications,Computers,0.0
212399,The Orphan Of Ellis Island (Time Travel Advent...,Elvira Woodruff,Scholastic Paperbacks,Juvenile Fiction,2.0
212401,Mamaw,Wild Wild Cabbage,NaN,NaN,0.0
212402,The Autograph Man,Zadie Smith,Vintage,Fiction,19.0
212403,Student's Solutions Manual for Johnson/Mowry's...,"David B. Johnson', 'Thomas A. Mowry",Brooks/Cole Publishing Company,NaN,0.0

In [153]:
#Código para ver el tipo de datos en segundo dataframe
display(df2, df2.dtypes)

         Unnamed: 0                          title2  price  review_score
0                 0  Its Only Art If Its Well Hung!    NaN           4.0
1                 1        Dr. Seuss: American Icon    NaN           5.0
2                 2        Dr. Seuss: American Icon    NaN           5.0
3                 3        Dr. Seuss: American Icon    NaN           4.0
4                 4        Dr. Seuss: American Icon    NaN           4.0
...             ...                             ...    ...           ...
2999787     2999995             The Idea of History    NaN           4.0
2999788     2999996             The Idea of History    NaN           4.0
2999789     2999997             The Idea of History    NaN           4.0
2999790     2999998             The Idea of History    NaN           5.0
2999791     2999999             The Idea of History    NaN           1.0

[2999792 rows x 4 columns]

Unnamed: 0        int64
title2           object
price           float64
review_score    float64
dtype: object

In [157]:
#Para trabajar con el dataframe2 dejo solo las columnas con información relevante que voy a utilizar
df2 = df2[['Title','Price','review/score']]

In [16]:
df2['Title'].isnull().sum()

208

In [17]:
df2 = df2.dropna(subset=['Title'])

In [77]:
#Compruebo los valores nulos en la columna Price del dataframe2
df2['Price'].isnull().sum()

2518628

In [23]:
#Elimino los valores nulos de la columna Price del dataframe2
#df2 = df2.dropna(subset=['Price'])

In [31]:
df2['review_score'].isnull().sum()

0

In [158]:
df2

                                 title2  price  review_score
0        Its Only Art If Its Well Hung!    NaN           4.0
1              Dr. Seuss: American Icon    NaN           5.0
2              Dr. Seuss: American Icon    NaN           5.0
3              Dr. Seuss: American Icon    NaN           4.0
4              Dr. Seuss: American Icon    NaN           4.0
...                                 ...    ...           ...
2999787             The Idea of History    NaN           4.0
2999788             The Idea of History    NaN           4.0
2999789             The Idea of History    NaN           4.0
2999790             The Idea of History    NaN           5.0
2999791             The Idea of History    NaN           1.0

[2999792 rows x 3 columns]

In [159]:
df2.shape

(2999792, 3)

## **CONSULTAS SQL UTILIZANDO PYTHON**

In [19]:
#Para usar SQL hay que quitar los espacios en los nombres de las columnas de los dataframes
df = df.rename(columns={"Title": "title", "authors": "authors", "publisher": "publisher", "categories": "categories", "ratingsCount": "ratingsCount"})

In [3]:
#Numero total de libros a la venta
q = """
SELECT
COUNT(DISTINCT title) AS Total_Libros_Venta
FROM df
"""

df_export = pysqldf(q)
#df_export.to_csv('books_data.csv')

In [4]:
df_export

   Total_Libros_Venta
0              180990

In [5]:
#Numero total de autores 
q = """
SELECT
COUNT(DISTINCT authors) AS Total_Autores
FROM df
"""

df_export = pysqldf(q)
#df_export.to_csv('books_data.csv')

In [6]:
df_export

   Total_Autores
0         127275

In [7]:
#Numero total de editoriales
q = """
SELECT
COUNT(DISTINCT publisher) AS Total_Editoriales
FROM df
"""

df_export = pysqldf(q)
#df_export.to_csv('books_data.csv')

In [8]:
df_export

   Total_Editoriales
0              15802

In [9]:
#Numero total de categorias
q = """
SELECT
COUNT(DISTINCT categories) AS Total_Categorias
FROM df
"""

df_export = pysqldf(q)
#df_export.to_csv('books_data.csv')

In [8]:
#Se hace la query y se guarda en una variable, para despues mandarla como parametro en una función lambda
q = """
SELECT TOP 5
authors, COUNT(authors) AS Total_Libros_Venta_authors
FROM df
GROUP BY authors
ORDER BY Total_Libros_Venta_authors DESC
"""

df_export = pysqldf(q)

In [20]:
#Se exporta la información a el archivo, en caso de que se quiera
#df_export.to_csv("Books_data.csv")

In [9]:
#Se muestran los datos extraidos de la query, que autores tienen más libros a la venta en Amazon
df_export

,authors,Total_libros_a_la_venta
0,['Rose Arny'],236
1,['William Shakespeare'],191
2,['Library of Congress. Copyright Office'],178
3,['Agatha Christie'],142
4,['Erle Stanley Gardner'],124
...,...,...
127272,"[""A. H. Gebhard-L'Estrange""]",1
127273,"[""A'isha Ajayi""]",1
127274,"[""'Jig rten mgon po (('Bri gung chos rje ;)"", ...",1
127275,"[""'Annah Sobelman""]",1
127276,"[""'Abd al-Samih Abu 'Umar""]",1

In [19]:
#Qué editorial tiene más libros a la venta en Amazon
q = """
SELECT
publisher, COUNT(publisher) AS Total_Libros_Venta_publisher
FROM df
GROUP BY publisher
ORDER BY Total_Libros_Venta_publisher DESC
"""

df_export = pysqldf(q)
#df_export.to_csv('books_data.csv')

In [20]:
#Qué editorial tiene más libros a la venta en Amazon
df_export

                               publisher  Total_Libros_Venta_publisher
0                     Simon and Schuster                          3441
1                                Penguin                          2803
2                              Routledge                          2389
3                      John Wiley & Sons                          2028
4                         Harper Collins                          1907
...                                  ...                           ...
15798                      1-881713-71-7                             1
15799                           *Red Hat                             1
15800           *A Wiley-QED Publication                             1
15801  'The Rosen Publishing Group, Inc'                             1
15802                               None                             0

[15803 rows x 2 columns]

In [27]:
#Libros, autores, categorias con mayor numero de valoraciones por la gente
q = """
SELECT
title, authors, publisher, categories, ratingsCount 
FROM df
GROUP BY title
ORDER BY ratingsCount DESC
"""

df_export = pysqldf(q)
#df_export.to_csv('books_data.csv')

In [28]:
df_export

                                                    Title  ratingsCount
0                                           The Alchemist        4895.0
1                                                Unbroken        4572.0
2       A Mission to Millions; The Story of Ernie Alle...        4572.0
3       Blue Like Jazz: Nonreligious Thoughts on Chris...        4562.0
4                                                 Eclipse        4392.0
...                                                   ...           ...
180985  "A Truthful Impression of the Country": Britis...           0.0
180986       "A Titanic hero" Thomas Andrews, shipbuilder           0.0
180987  "... And Poetry is Born ..." Russian Classical...           0.0
180988  " We'll Always Have Paris": The Definitive Gui...           0.0
180989           " Film technique, " and, " Film acting "           0.0

[180990 rows x 2 columns]

In [22]:
#Categorias más comunes
q = """
SELECT
categories, COUNT(categories) AS Total_Libros_Venta_categories
FROM df
GROUP BY categories
ORDER BY Total_Libros_Venta_categories DESC
"""

df_export = pysqldf(q)
#df_export.to_csv("books_data.csv")

In [23]:
df_export

,categories,Total_Libros_Venta_categories
0,Fiction,23391
1,Religion,9349
2,History,9273
3,Juvenile Fiction,6476
4,Biography & Autobiography,6307
...,...,...
10418,.conometrics,1
10419,*AW01 - India - Indien,1
10420,"""Fram"" Expedition",1
10421,"""Billed as ""a musical about an old operetta,"" ...",1
10422,None,0

In [18]:
#Para usar SQL hay que quitar los espacios en los nombres de las columnas de los dataframes
df2 = df2.rename(columns={"Title": "title2", "Price": "price", "review/score": "review_score"})

In [39]:
#Libros más caros
q = """
SELECT 
title2, price
FROM df2
GROUP BY title2
ORDER BY price DESC
"""

df_export = pysqldf(q)
#df_export.to_csv('Books_rating.csv')

In [99]:
df_export

                                                    title  price
0       Visual Genetics Plus: Tutorial and Lab Simulat...  995.0
1       Advances in Chemical Physics, Volume 119: Mode...  890.0
2          Youmans Neurological Surgery (Four Volume Set)  875.0
3                    Leechdoms, Wortcunning and Starcraft  840.0
4       Chicago School Pragmatism (History of American...  840.0
...                                                   ...    ...
212398  "A careless word, a needless sinking": A histo...    NaN
212399       "A Titanic hero" Thomas Andrews, shipbuilder    NaN
212400  "... And Poetry is Born ..." Russian Classical...    NaN
212401  " We'll Always Have Paris": The Definitive Gui...    NaN
212402           " Film technique, " and, " Film acting "    NaN

[212403 rows x 2 columns]

In [ ]:
#Libros con mejor promedio de puntuación de reseña 
q = """
SELECT 
title2, (SUM(review_score) / COUNT(review_score)) AS Promedio_reseña, ratingsCount, COUNT(review_score) AS Cuenta
FROM df2
JOIN df
ON df2.title2 = df.title
WHERE ratingsCount >= 2500
GROUP BY title2
HAVING Cuenta > 10
ORDER BY Promedio_reseña DESC
"""

df_export = pysqldf(q)
#df_export.to_csv('Books_rating.csv')

In [62]:
df_export

,title2,Promedio_reseña,ratingsCount,Cuenta
0,properties of Gases and Liquids,5.000000,1.0,11
1,babyTales: A Pregnancy Companion,5.000000,0.0,24
2,You Can't Take It With You: A Play,5.000000,3.0,11
3,You Can Stop Smoking,5.000000,1.0,19
4,You Are Here Traveling with JohnnyJet.com: The...,5.000000,0.0,18
...,...,...,...,...
34827,Sams Teach Yourself More Visual Basic 6 in 21 ...,1.166667,0.0,18
34828,McGraw-Hill's LSAT,1.142857,0.0,14
34829,MCSE Windows 2000 Security Design Exam Cram (E...,1.133333,0.0,15
34830,Unglued & Tattooed: How to Save Your Teen from...,1.090909,68.0,11
34831,Cracking the GRE Chemistry (Princeton Review S...,1.000000,0.0,17

In [ ]:
#Libros con mejor promedio de puntuación de reseña (otra forma de hacerlo)
q = """
SELECT 
df2.title, (SUM(df2.review_score) / COUNT(df2.review_score)) AS Promedio_reseña, df.ratingsCount, COUNT(df2.review_score) AS Cuenta
FROM df, df2
WHERE df.Title= df2.title AND df.ratingsCount >= 2500 
GROUP BY df2.title
HAVING Cuenta > 10
ORDER BY Promedio_reseña DESC
"""

df_export = pysqldf(q)
#df_export.to_csv('Books_rating.csv')

In [ ]:
df_export